# RbsReferenceFreesize Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsReferenceFreesize Property
ParameterTypeId Class See Also
---
"Free Size"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsReferenceFreesize { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsReferenceFreesize As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsReferenceFreesize {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace